<!DOCTYPE html>
<html lang="pl">
<head>
        <meta charset="utf-8">
        <title>Udemy</title>
        <link rel="stylesheet" type="text/css" href="../css/style.css" />
</head>
<body>
        <div class="header">
            <span><a href="../index.html">Kurs Udemy</a></span>
             <p align="center">
                 <a target="blank" href="https://www.udemy.com/kurs-tworzenia-stron-www-w-html-i-css-od-podstaw-do-eksperta/learn/v4/content">www.udemy.com/kurs-tworzenia-stron-www-w-html-i-css-od-podstaw-do-eksperta</a>
            </p>
        </div>
        <div class="menu">
            <ol>
                <li>
                    <a href="sites/meta_tagi.html">Meta Tagi</a>
                </li>
                <li>
                    <a href="sites/formatowanie_tekstu.html">Formatowanie tekstu</a>
                </li>    
                <li>
                    <a href="sites/tabele.html">Tabele</a>
                </li>
                <li>
                    <a href="../strona_kursu/index.html">Strona kursowa</a>
                </li>

            </ol>

        </div>
        <div class="content">
            <pre>
            &#x3C;html&#x3E;
            &#x9;&#x3C;head&#x3E;
            &#x9;  &#x3C;meta http-equiv=&#x22;content-language&#x22; content=&#x22;pl&#x22; /&#x3E;
            &#x9;  
                  &#x3C;meta name=&#x22;author&#x22; content=&#x22;Arkadiusz W&#x142;odarczyk&#x22; /&#x3E;
            &#x9;  &#x3C;meta name=&#x22;robots&#x22; content=&#x22;index, follow&#x22; /&#x3E;
            &#x9;&#x9;&#x3C;title&#x3E;Video Kurs - Video Kursy&#x3C;/title&#x3E;
            &#x9;  &#x3C;meta name=&#x22;description&#x22; content=&#x22;Video Kursy Tworzenia stron WWW oraz Video Kursy Programowania&#x22; /&#x3E;
            &#x9;  &#x3C;meta name=&#x22;keywords&#x22; content=&#x22;video kurs, video kursy, video, kurs&#x22; /&#x3E;&#x9;&#x9;
            &#x9;&#x9;
            &#x9;&#x3C;/head&#x3E;
            &#x9;&#x3C;body style=&#x22;background-color: rgb(255,235,205)&#x22;&#x3E;
            &#x9;&#x9;&#x3C;!-- bgcolor = backgroundcolor = kolor t&#x142;a--&#x3E;
            &#x9;&#x9;&#x3C;!-- p = paragraph = akapit --&#x3E;
            &#x9;&#x9;&#x3C;p align=&#x22;justify&#x22; title=&#x27;Ten tekst zosta&#x142; napisany przez &#x22;Arkadiusza W&#x142;odarczyka&#x22;&#x27;&#x3E;Zacznijmy od tego, kt&#xF3;r&#x105; ga&#x142;&#x105;&#x17A; informatyki mam zamiar omawia&#x107;, 
            poniewa&#x17C; poj&#x119;cie &#x22;informatyka&#x22; jest bardzo wieloznaczne. W sumie to informatykiem w dzisiejszym skomputeryzowanym &#x15B;wiecie mo&#x17C;e nazwa&#x107; si&#x119; prawie ka&#x17C;dy - wystarczy, &#x17C;e potrafi si&#x119; przetwarza&#x107; informacj&#x119; znajduj&#x105;ce si&#x119; w naszych komputerach, czyli np. przeszukiwa&#x107; zawarto&#x15B;&#x107; internetu przy pomocy wyszukiwarki.&#x3C;/p&#x3E;asd
            x3E;Ja mam zamiar przekaza&#x107; Ci tajniki w jaki spos&#xF3;b efektywnie uczy&#x107; si&#x119; programowa&#x107;. Co to tak naprawd&#x119; oznacza s&#x142;owo PROGRAMOWANIE? Programowanie oznacza pisanie kodu w jakim&#x15B; j&#x119;zyku, czyli czym&#x15B; za pomoc&#x105; czego mo&#x17C;emy komunikowa&#x107; si&#x119; z nasz&#x105; mo&#x17C;na by rzec bez nas g&#x142;upi&#x105; (przynajmniej na razie) maszyn&#x105; PC (Personal Computer). Czyli programowanie mo&#x17C;na by por&#xF3;wna&#x107; do pisania tej&#x17C;e tutaj lekcji, przy pomocy kt&#xF3;rej komunikuj&#x119; si&#x119; z Tob&#x105; w j&#x119;zyku polskim. My skupimy si&#x119; jednak na programowaniu w innym j&#x119;zyku, a dok&#x142;adniej b&#x119;dzie nim Java. Oznacza to, &#x17C;e przy pomocy Javy, b&#x119;dziemy pisa&#x107; pewnego rodzaju artyku&#x142; w naszym wypadku b&#x119;dzie to kod &#x17A;r&#xF3;d&#x142;owy, kt&#xF3;ry zostanie zamieniony na j&#x119;zyk zrozumia&#x142;y przez nasz&#x105; maszyn&#x119;.&#x3C;/p&#x3E; 
            &#x9;&#x3C;/body&#x3E;&#x9;
            &#x3C;/html&#x3E;
            </pre>
        </div>
</body>
</html>
